app/Controllers/Api/AuthDispositivo.php


        $deviceKey = $esMac ? $device : ('AID:' . $deviceNoSep);

        $user = $usuarioModel->where('direccion_mac', $deviceKey)->first();
---
SELECT *
FROM `usuarios`
WHERE `direccion_mac` = '6A:F2:EC:21:A4:21'
 LIMIT 1

                'fecha_creacion' => date('Y-m-d H:i:s'),
            ];

            if (!$usuarioModel->insert($insert)) {
---
INSERT INTO `usuarios` (`usuario`, `password`, `rol`, `direccion_mac`, `activo`, `fecha_creacion`) VALUES ('cli_80c498a0d9', '$2y$10$hz5idl2vwjpd/CNk51aBeu4Y/gPOozMMPuGUTl4F98xdOj6qPz8OW', 'cliente', '6A:F2:EC:21:A4:21', 1, '2026-02-15 13:59:57')