app/Controllers/Api/AuthController.php

    public function login()
    {
        $payload = $this->request->getJSON(true) ?: [];

        $correo = strtolower(trim((string)($this->request->getPost('correo') ?? ($payload['correo'] ?? ''))));
        $pass   = (string)($this->request->getPost('password') ?? ($payload['password'] ?? ''));

        if ($correo === '' || !filter_var($correo, FILTER_VALIDATE_EMAIL)) {
            return $this->response->setStatusCode(400)->setJSON([
                'ok' => false,
                'message' => 'Correo inválido.'
            ]);
        }

        if ($pass === '' || strlen($pass) < 6) {
            return $this->response->setStatusCode(400)->setJSON([
                'ok' => false,
                'message' => 'Contraseña inválida.'
            ]);
        }

        $db = \Config\Database::connect();

        $user = $db->table('tbl_rel_usuario usr')
            ->select('usr.usuarioId, usr.usuario_nombre, usr.usuario_Contrasena, usr.usuario_Activo, usr.imageId, cont.contacto_Valor AS correo, img.image_Url')
            ->join('tbl_ope_persona per', 'per.personaId = usr.personaId', 'inner')
            ->join(
                'tbl_rel_contacto cont',
                'cont.personaId = per.personaId AND cont.tipocontactoId = 1 AND cont.contacto_Activo = 1',
                'inner'
            )
            ->join('tbl_ope_image img', 'img.imageId = usr.imageId AND img.image_Activo = 1', 'left')
            ->where('cont.contacto_Valor', $correo)
            ->get(1)
            ->getRowArray();
---
SELECT `usr`.`usuarioId`, `usr`.`usuario_nombre`, `usr`.`usuario_Contrasena`, `usr`.`usuario_Activo`, `usr`.`imageId`, `cont`.`contacto_Valor` AS `correo`, `img`.`image_Url`
FROM `tbl_rel_usuario` `usr`
INNER JOIN `tbl_ope_persona` `per` ON `per`.`personaId` = `usr`.`personaId`
INNER JOIN `tbl_rel_contacto` `cont` ON `cont`.`personaId` = `per`.`personaId` AND `cont`.`tipocontactoId` = 1 AND `cont`.`contacto_Activo` = 1
LEFT JOIN `tbl_ope_image` `img` ON `img`.`imageId` = `usr`.`imageId` AND `img`.`image_Activo` = 1
WHERE `cont`.`contacto_Valor` = 'julioantoniogarciapeza@gmail.com'
 LIMIT 1

        }

        // Roles activos
        $roles = $db->table('tbl_ope_rolesdetalle rd')
            ->select('r.rolesId, r.roles_Valor')
            ->join('tbl_cat_roles r', 'r.rolesId = rd.rolesId AND r.roles_Activo = 1', 'inner')
            ->where('rd.usuarioId', (int)$user['usuarioId'])
            ->where('rd.rolesDetalle_Activo', 1)
            ->get()->getResultArray();
---
SELECT `r`.`rolesId`, `r`.`roles_Valor`
FROM `tbl_ope_rolesdetalle` `rd`
INNER JOIN `tbl_cat_roles` `r` ON `r`.`rolesId` = `rd`.`rolesId` AND `r`.`roles_Activo` = 1
WHERE `rd`.`usuarioId` = 4
AND `rd`.`rolesDetalle_Activo` = 1