app/Controllers/Api/PeliculasController.php

    public function index()
    {
        $db = \Config\Database::connect();

        $rows = $db->table('tbl_rel_pelicula p')
            ->select("
                p.peliculaId,
                p.pelicula_Nombre,
                p.pelicula_Descripcion,
                p.pelicula_TrailerUrl,
                p.pelicula_Creacion,
                p.pelicula_Activo,
                g.generoId,
                g.genero_Valor,
                c.clasificacionId,
                c.clasificacion_Valor,
                img.imageId,
                img.image_Url
            ")
            ->join('tbl_cat_genero g', 'g.generoId = p.generoId', 'inner')
            ->join('tbl_cat_clasificacion c', 'c.clasificacionId = p.clasificacionId', 'inner')
            ->join('tbl_ope_image img', 'img.imageId = p.imageId AND img.image_Activo = 1', 'left')
            ->where('p.pelicula_Activo', 1)
            ->orderBy('p.peliculaId', 'DESC')
            ->get()->getResultArray();
---
SELECT `p`.`peliculaId`, `p`.`pelicula_Nombre`, `p`.`pelicula_Descripcion`, `p`.`pelicula_TrailerUrl`, `p`.`pelicula_Creacion`, `p`.`pelicula_Activo`, `g`.`generoId`, `g`.`genero_Valor`, `c`.`clasificacionId`, `c`.`clasificacion_Valor`, `img`.`imageId`, `img`.`image_Url`
FROM `tbl_rel_pelicula` `p`
INNER JOIN `tbl_cat_genero` `g` ON `g`.`generoId` = `p`.`generoId`
INNER JOIN `tbl_cat_clasificacion` `c` ON `c`.`clasificacionId` = `p`.`clasificacionId`
LEFT JOIN `tbl_ope_image` `img` ON `img`.`imageId` = `p`.`imageId` AND `img`.`image_Activo` = 1
WHERE `p`.`pelicula_Activo` = 1
ORDER BY `p`.`peliculaId` DESC