app/Controllers/Api/Productos.php

SELECT *
FROM `productos`
WHERE `productos`.`id_producto` = 1
---
    public function index()
    {
        $categoriaId = $this->request->getGet('categoriaId');

        $q = $this->model;

        if ($categoriaId !== null && $categoriaId !== '') {
            $q = $q->where('id_categoria', (int) $categoriaId);
        }

        return $this->respond($q->orderBy('id_producto', 'DESC')->findAll());