app/Controllers/Api/Ventas.php

    public function index()
    {
        return $this->respond($this->model->orderBy('id_venta', 'DESC')->findAll());
---
SELECT *
FROM `ventas`
ORDER BY `id_venta` DESC

    public function show($id = null)
    {
        $venta = $this->model->find($id);
        if (!$venta)
            return $this->failNotFound('Venta no encontrada');

        $detalles = $this->detalleModel
            ->select('detalle_venta.*, productos.detalle, productos.marca, productos.modelo, productos.precio AS precio_producto')
            ->join('productos', 'productos.id_producto = detalle_venta.id_producto', 'inner')
            ->where('detalle_venta.id_venta', (int) $id)
            ->findAll();
---
SELECT `detalle_venta`.*, `productos`.`detalle`, `productos`.`marca`, `productos`.`modelo`, `productos`.`precio` AS `precio_producto`
FROM `detalle_venta`
INNER JOIN `productos` ON `productos`.`id_producto` = `detalle_venta`.`id_producto`
WHERE `detalle_venta`.`id_venta` = 1