app/Controllers/AccesoController.php

SELECT `usr`.`usuarioId`, `usr`.`usuario_nombre`, `usr`.`usuario_Contrasena`, `usr`.`usuario_Activo`, `usr`.`personaId`, `usr`.`imageId`, `cont`.`contacto_Valor` AS `correo`, `per`.`persona_Nombre`, `per`.`persona_ApllP`, `per`.`persona_ApllM`, `img`.`image_Url` AS `imageUrl`
FROM `tbl_rel_usuario` `usr`
INNER JOIN `tbl_ope_persona` `per` ON `per`.`personaId` = `usr`.`personaId`
INNER JOIN `tbl_rel_contacto` `cont` ON `cont`.`personaId` = `per`.`personaId`
LEFT JOIN `tbl_ope_image` `img` ON `img`.`imageId` = `usr`.`imageId` AND `img`.`image_Activo` = 1
WHERE `usr`.`usuario_Activo` = 1
AND `cont`.`contacto_Activo` = 1
AND `cont`.`tipocontactoId` = 1
AND `cont`.`contacto_Valor` = 'julioantoniogarciapeza@gmail.com'
ORDER BY `usr`.`usuarioId` DESC
 LIMIT 1
---
    public function login(): RedirectResponse
    {
        if (!$this->request->is('post')) {
            return redirect()->to(site_url('acceso/login'));
        }

        $correo = strtolower(trim((string) ($this->request->getPost('correo') ?? $this->request->getPost('usuario'))));
        $pass   = (string) $this->request->getPost('password');

        if ($correo === '' || !filter_var($correo, FILTER_VALIDATE_EMAIL)) {
            return redirect()->back()->withInput()->with('toast_error', 'Ingresa un correo válido.');
        }

        if (strlen($pass) < 6) {
            return redirect()->back()->withInput()->with('toast_error', 'Contraseña inválida.');
        }

        $db = \Config\Database::connect();


        $user = $db->table('tbl_rel_usuario usr')
            ->select([
                'usr.usuarioId',
                'usr.usuario_nombre',
                'usr.usuario_Contrasena',
                'usr.usuario_Activo',
                'usr.personaId',
                'usr.imageId',
                'cont.contacto_Valor AS correo',
                'per.persona_Nombre',
                'per.persona_ApllP',
                'per.persona_ApllM',
                'img.image_Url AS imageUrl',
            ])
            ->join('tbl_ope_persona per', 'per.personaId = usr.personaId', 'inner')
            ->join('tbl_rel_contacto cont', 'cont.personaId = per.personaId', 'inner')
            ->join('tbl_ope_image img', 'img.imageId = usr.imageId AND img.image_Activo = 1', 'left')
            ->where('usr.usuario_Activo', 1)
            ->where('cont.contacto_Activo', 1)
            ->where('cont.tipocontactoId', 1)
            ->where('cont.contacto_Valor', $correo)
            ->orderBy('usr.usuarioId', 'DESC')
            ->get(1)
            ->getRowArray();

SELECT `r`.`roles_Valor`
FROM `tbl_ope_rolesdetalle` `rd`
INNER JOIN `tbl_cat_roles` `r` ON `r`.`rolesId` = `rd`.`rolesId`
WHERE `rd`.`usuarioId` = 4
AND `rd`.`rolesDetalle_Activo` = 1
AND `r`.`roles_Activo` = 1
ORDER BY `r`.`roles_Valor` ASC
---
            return redirect()->back()->withInput()->with('toast_error', 'Correo o contraseña incorrectos.');
        }

        $rolesRows = $db->table('tbl_ope_rolesdetalle rd')
            ->select('r.roles_Valor')
            ->join('tbl_cat_roles r', 'r.rolesId = rd.rolesId', 'inner')
            ->where('rd.usuarioId', (int) $user['usuarioId'])
            ->where('rd.rolesDetalle_Activo', 1)
            ->where('r.roles_Activo', 1)
            ->orderBy('r.roles_Valor', 'ASC')
            ->get()
            ->getResultArray();