app/Controllers/AccesoController.php

            return redirect()->back()->withInput()->with('toast_error', 'Usuario/correo o contraseña incorrectos.');
        }

        $rolesRows = $db->table('tbl_ope_rolesdetalle rd')
            ->select(['r.roles_Valor'])
            ->join('tbl_cat_roles r', 'r.rolesId = rd.rolesId AND r.roles_Activo = 1', 'inner')
            ->where('rd.usuarioId', (int)$user['usuarioId'])
            ->where('rd.rolesDetalle_Activo', 1)
            ->orderBy('r.roles_Valor', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT `r`.`roles_Valor`
FROM `tbl_ope_rolesdetalle` `rd`
INNER JOIN `tbl_cat_roles` `r` ON `r`.`rolesId` = `rd`.`rolesId` AND `r`.`roles_Activo` = 1
WHERE `rd`.`usuarioId` = 4
AND `rd`.`rolesDetalle_Activo` = 1
ORDER BY `r`.`roles_Valor` ASC