app/Controllers/Home.php

    public function index()
    {

        $db = \Config\Database::connect();

        $peliculasNetflix = $db->table('tbl_rel_pelicula p')
            ->select("
                p.peliculaId      AS peliculaId,
                p.pelicula_Nombre AS titulo,
                p.pelicula_Descripcion AS descripcion,
                p.pelicula_TrailerUrl  AS video,
                p.pelicula_Creacion    AS creacion,
                img.image_Url          AS imagen,
                g.genero_Valor         AS genero,
                c.clasificacion_Valor  AS clasificacion
            ")
            ->join('tbl_cat_genero g', 'g.generoId = p.generoId AND g.genero_Activo = 1', 'inner')
            ->join('tbl_cat_clasificacion c', 'c.clasificacionId = p.clasificacionId AND c.clasificacion_Activo = 1', 'inner')
            ->join('tbl_ope_image img', 'img.imageId = p.imageId AND img.image_Activo = 1', 'left')
            ->where('p.pelicula_Activo', 1)
            ->orderBy('p.peliculaId', 'DESC')
            ->get()->getResultArray();
---
SELECT `p`.`peliculaId` AS `peliculaId`, `p`.`pelicula_Nombre` AS `titulo`, `p`.`pelicula_Descripcion` AS `descripcion`, `p`.`pelicula_TrailerUrl` AS `video`, `p`.`pelicula_Creacion` AS `creacion`, `img`.`image_Url` AS `imagen`, `g`.`genero_Valor` AS `genero`, `c`.`clasificacion_Valor` AS `clasificacion`
FROM `tbl_rel_pelicula` `p`
INNER JOIN `tbl_cat_genero` `g` ON `g`.`generoId` = `p`.`generoId` AND `g`.`genero_Activo` = 1
INNER JOIN `tbl_cat_clasificacion` `c` ON `c`.`clasificacionId` = `p`.`clasificacionId` AND `c`.`clasificacion_Activo` = 1
LEFT JOIN `tbl_ope_image` `img` ON `img`.`imageId` = `p`.`imageId` AND `img`.`image_Activo` = 1
WHERE `p`.`pelicula_Activo` = 1
ORDER BY `p`.`peliculaId` DESC