app/Controllers/PeliculasController.php

SELECT `p`.*, `g`.`genero_Valor`, `c`.`clasificacion_Valor`, `img`.`image_Url`
FROM `tbl_rel_pelicula` `p`
INNER JOIN `tbl_cat_genero` `g` ON `g`.`generoId` = `p`.`generoId`
INNER JOIN `tbl_cat_clasificacion` `c` ON `c`.`clasificacionId` = `p`.`clasificacionId`
LEFT JOIN `tbl_ope_image` `img` ON `img`.`imageId` = `p`.`imageId` AND `img`.`image_Activo` = 1
WHERE `p`.`pelicula_Activo` = 1
ORDER BY `p`.`peliculaId` DESC
SELECT *
FROM `tbl_cat_genero`
WHERE `genero_Activo` = 1
ORDER BY `genero_Valor` ASC
SELECT *
FROM `tbl_cat_clasificacion`
WHERE `clasificacion_Activo` = 1
ORDER BY `clasificacion_Valor` ASC
---
    public function index(): string
    {
        $db = \Config\Database::connect();

        $estado = (string) ($this->request->getGet('estado') ?? 'activos');

        $qb = $db->table('tbl_rel_pelicula p')
            ->select('p.*, g.genero_Valor, c.clasificacion_Valor, img.image_Url')
            ->join('tbl_cat_genero g', 'g.generoId = p.generoId', 'inner')
            ->join('tbl_cat_clasificacion c', 'c.clasificacionId = p.clasificacionId', 'inner')
            ->join('tbl_ope_image img', 'img.imageId = p.imageId AND img.image_Activo = 1', 'left')
            ->orderBy('p.peliculaId', 'DESC');

        if ($estado === 'activos') {
            $qb->where('p.pelicula_Activo', 1);
        } elseif ($estado === 'inactivos') {
            $qb->where('p.pelicula_Activo', 0);
        } // todos = sin filtro

        $peliculas = $qb->get()->getResultArray();

        $generos = $db->table('tbl_cat_genero')
            ->where('genero_Activo', 1)
            ->orderBy('genero_Valor', 'ASC')
            ->get()->getResultArray();

        $clasificaciones = $db->table('tbl_cat_clasificacion')
            ->where('clasificacion_Activo', 1)
            ->orderBy('clasificacion_Valor', 'ASC')
            ->get()->getResultArray();