app/Controllers/UsuariosController.php

    private function generateUsername(string $nombre, string $ap, \CodeIgniter\Database\BaseConnection $db): string
    {
        $base = $this->normalizeUser(mb_substr($nombre, 0, 1, 'UTF-8') . $ap);
        $username = $base;
        $i = 1;

        while ($db->table('tbl_rel_usuario')->where('usuario_nombre', $username)->countAllResults() > 0) {
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_rel_usuario`
WHERE `usuario_nombre` = 'jddsds'


        $db = \Config\Database::connect();

        $correoExistente = $db->table('tbl_rel_contacto')
            ->where('tipocontactoId', 1)
            ->where('contacto_Valor', $correo)
            ->where('contacto_Activo', 1)
            ->get()->getRowArray();
---
SELECT *
FROM `tbl_rel_contacto`
WHERE `tipocontactoId` = 1
AND `contacto_Valor` = 'soporte.practicas.ubam@gmail.com'
AND `contacto_Activo` = 1


                $hash = hash_file('sha256', $movedFullPath);

                $existing = $db->table('tbl_ope_image')->select('imageId')->where('image_Hash', $hash)->get()->getRowArray();
---
SELECT `imageId`
FROM `tbl_ope_image`
WHERE `image_Hash` = 'd08806c981c86f985ba29465fae5d9872817191253e92dfefb0b49cacbc84294'

 public function index(): string
    {
        $db = \Config\Database::connect();

        $estado = (string)($this->request->getGet('estado') ?? 'all'); // '1','0','all'
        $estado = in_array($estado, ['1','0','all'], true) ? $estado : 'all';

        $builder = $db->table('tbl_rel_usuario u')
            ->select("
                u.usuarioId, u.usuario_nombre, u.usuario_Activo, u.personaId, u.imageId,
                p.persona_Nombre, p.persona_ApllP, p.persona_ApllM, p.persona_FechaNacimiento,
                c.contacto_Valor AS correo,
                r.rolesId, r.roles_Valor,
                img.image_Url
            ")
            ->join('tbl_ope_persona p', 'p.personaId = u.personaId', 'inner')
            ->join('tbl_rel_contacto c', 'c.personaId = p.personaId AND c.tipocontactoId = 1 AND c.contacto_Activo = 1', 'left')
            // solo el rol ACTIVO
            ->join('tbl_ope_rolesdetalle rd', 'rd.usuarioId = u.usuarioId AND rd.rolesDetalle_Activo = 1', 'left')
            ->join('tbl_cat_roles r', 'r.rolesId = rd.rolesId AND r.roles_Activo = 1', 'left')
            ->join('tbl_ope_image img', 'img.imageId = u.imageId AND img.image_Activo = 1', 'left')
            ->orderBy('u.usuarioId', 'DESC');

        if ($estado !== 'all') {
            $builder->where('u.usuario_Activo', (int)$estado);
        }

        $usuarios = $builder->get()->getResultArray();

        $roles = $db->table('tbl_cat_roles')
            ->where('roles_Activo', 1)
            ->orderBy('roles_Valor', 'ASC')
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_cat_roles`
WHERE `roles_Activo` = 1
ORDER BY `roles_Valor` ASC